#### Terraform Format and Style 🖌 `failure` (ignored)
#### Terraform Initialization ⚙️ `success`
#### Terraform Validation 🤖 Success! The configuration is valid.


#### Terraform Plan 📖 `success`

<details><summary>Show Plan</summary>

```terraform
An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  - destroy
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.github.data.github_branch.gesassoMkMail_master will be read during apply
  # (config refers to values not yet known)
 <= data "github_branch" "gesassoMkMail_master"  {
      + branch     = "master"
      + etag       = (known after apply)
      + id         = (known after apply)
      + ref        = (known after apply)
      + repository = "gesasso-mkmail"
      + sha        = (known after apply)
    }

  # module.github.github_branch_default.gesassoMkMail will be created
  + resource "github_branch_default" "gesassoMkMail" {
      + branch     = "master"
      + id         = (known after apply)
      + repository = "gesasso-mkmail"
    }

  # module.github.github_branch_protection.gesassoMkMail_master will be created
  + resource "github_branch_protection" "gesassoMkMail_master" {
      + enforce_admins         = false
      + id                     = (known after apply)
      + pattern                = "master"
      + repository_id          = (known after apply)
      + require_signed_commits = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + require_code_owner_reviews      = true
          + required_approving_review_count = 1
        }
    }

  # module.github.github_repository.gesassoMkMail will be created
  + resource "github_repository" "gesassoMkMail" {
      + allow_merge_commit     = true
      + allow_rebase_merge     = true
      + allow_squash_merge     = true
      + archived               = false
      + auto_init              = false
      + default_branch         = (known after apply)
      + delete_branch_on_merge = true
      + description            = "Le nécessaire pour les mails"
      + etag                   = (known after apply)
      + full_name              = (known after apply)
      + git_clone_url          = (known after apply)
      + has_downloads          = false
      + has_issues             = true
      + has_projects           = true
      + has_wiki               = false
      + html_url               = (known after apply)
      + http_clone_url         = (known after apply)
      + id                     = (known after apply)
      + is_template            = false
      + name                   = "gesasso-mkmail"
      + node_id                = (known after apply)
      + private                = (known after apply)
      + repo_id                = (known after apply)
      + ssh_clone_url          = (known after apply)
      + svn_url                = (known after apply)
      + topics                 = [
          + "gesasso",
          + "infra",
        ]
      + visibility             = "private"
      + vulnerability_alerts   = true
    }

  # module.github.github_team.gesasso will be created
  + resource "github_team" "gesasso" {
      + description = "L'outil de gestion des assos au SiMDE"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "Gesasso"
      + node_id     = (known after apply)
      + privacy     = "closed"
      + slug        = (known after apply)
    }

  # module.github.github_team.gesasso_old will be created
  + resource "github_team" "gesasso_old" {
      + description = "Développer le gestionnaire des associations"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "gesasso_old"
      + node_id     = (known after apply)
      + privacy     = "closed"
      + slug        = (known after apply)
    }

  # module.github.github_team_repository.gesasso_gesasso2 will be destroyed
  - resource "github_team_repository" "gesasso_gesasso2" {
      - etag       = "W/\"02f0dc0a8a70aa2ef04168a9d40c38ed6b27ebec1d6d962c0744392b59e4dc38\"" -> null
      - id         = "3158197:gesasso2" -> null
      - permission = "push" -> null
      - repository = "gesasso2" -> null
      - team_id    = "3158197" -> null
    }

  # module.github.github_team_repository.gesasso_mkmail will be created
  + resource "github_team_repository" "gesasso_mkmail" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "push"
      + repository = "gesasso-mkmail"
      + team_id    = (known after apply)
    }

  # module.github.github_team_repository.gesasso_old_gesasso2 will be created
  + resource "github_team_repository" "gesasso_old_gesasso2" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "push"
      + repository = "gesasso2"
      + team_id    = (known after apply)
    }

  # module.github.module.old_NastuzziSamy.github_team_membership.membership["gesasso"] must be replaced
-/+ resource "github_team_membership" "membership" {
      ~ etag     = "W/\"9d9950e748f8ce8989b12df3e7a5cd5d832efe5d9e0db564463bc94e77b4f29e\"" -> (known after apply)
      ~ id       = "3158197:NastuzziSamy" -> (known after apply)
      ~ team_id  = "3158197" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.github.module.old_cesar_richard.github_team_membership.membership["gesasso"] must be replaced
-/+ resource "github_team_membership" "membership" {
      ~ etag     = "W/\"0c620fcb365f5cea25b5dd3e6293eef7a496f54572ba3f6c9b2a3d50b759db8f\"" -> (known after apply)
      ~ id       = "3158197:cesar-richard" -> (known after apply)
      ~ team_id  = "3158197" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.github.module.old_loic_jumel.github_team_membership.membership["gesasso"] must be replaced
-/+ resource "github_team_membership" "membership" {
      ~ etag     = "W/\"a65fd60a6e7d0c5fa0b55f3916aa53bcfe0ff32e1fb445114b56f9ce059951d4\"" -> (known after apply)
      ~ id       = "3158197:jumelloic" -> (known after apply)
      ~ team_id  = "3158197" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

Plan: 10 to add, 0 to change, 4 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.
```

</details>

*Pusher: @cesar-richard, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform CI`*